In [1]:
import pandas as pd
import numpy as np
# pd.set_option('display.max_columns', 70)
# pd.set_option('display.max_rows', None)

In [2]:
df = pd.DataFrame(np.zeros([2,2]), index = ["a","b"], columns = ["A","B"])
df

     A    B
a  0.0  0.0
b  0.0  0.0

In [3]:
df.rename({"a":"z"})

     A    B
z  0.0  0.0
b  0.0  0.0

In [4]:
df.rename({"A":"Z"},axis=1)

     Z    B
a  0.0  0.0
b  0.0  0.0

In [5]:
tmp = np.array([[0,1], [2,3]])
df = pd.DataFrame(tmp)
df

   0  1
0  0  1
1  2  3

In [6]:
tmp = np.array(range(4)).reshape(2, 2)
df = pd.DataFrame(tmp)
df

   0  1
0  0  1
1  2  3

In [7]:
df = df.sort_values(by=1,axis=1,ascending=False)
df

   1  0
0  1  0
1  3  2

In [8]:
df.sort_values(by=1,axis=1)

   0  1
0  0  1
1  2  3

In [9]:
df = pd.DataFrame( index = ["a","b"], columns = ["A","B"])
df

     A    B
a  NaN  NaN
b  NaN  NaN

In [10]:
df.fillna(1)

   A  B
a  1  1
b  1  1

In [11]:
df.fillna({'A': 1, 'B': 2})

   A  B
a  1  2
b  1  2

In [12]:
df.fillna({'A': 1})

   A    B
a  1  NaN
b  1  NaN

In [13]:
df = pd.DataFrame( index = ["a","b"], columns = ["A","B"])
df.loc["a",:] = 1
df

     A    B
a    1    1
b  NaN  NaN

In [14]:
df.dropna(how='all')

   A  B
a  1  1

In [15]:
df = pd.DataFrame( index = ["a","b"], columns = ["A","B"])
df["A"] = 1
df = df.assign(A=1)  #Same meaning
df

   A    B
a  1  NaN
b  1  NaN

In [16]:
df.dropna(how='all', axis=1)

   A
a  1
b  1

In [17]:
df0 = pd.DataFrame(np.zeros([2,2]), index = ["a","b"], columns = ["A","B"])
df1 = pd.DataFrame(np.ones([2,2]), index = ["c","d"], columns = ["A","B"])
# df0.append(df1) #should be avoided
df = pd.concat([df0,df1])
df

     A    B
a  0.0  0.0
b  0.0  0.0
c  1.0  1.0
d  1.0  1.0

In [18]:
display(df['A'].duplicated())
df.drop_duplicates()

a    False
b     True
c    False
d     True
Name: A, dtype: bool

     A    B
a  0.0  0.0
c  1.0  1.0

In [19]:
df = pd.DataFrame({"A": [0, 0, 1, 1],
                   "B": [0, 1, 1, 1]},
                  index=["a", "b", "c","d"])
display(df)
display(df.duplicated())
df.drop_duplicates()

   A  B
a  0  0
b  0  1
c  1  1
d  1  1

a    False
b    False
c    False
d     True
dtype: bool

   A  B
a  0  0
b  0  1
c  1  1

In [20]:
df0 = pd.DataFrame(np.zeros([2,2]), index = ["a","b"], columns = ["A","B"])
df1 = pd.DataFrame(np.ones([2,2]), index = ["c","d"], columns = ["A","D"])
# df0.append(df1) #should be avoided
df = pd.concat([df0,df1])
df

     A    B    D
a  0.0  0.0  NaN
b  0.0  0.0  NaN
c  1.0  NaN  1.0
d  1.0  NaN  1.0

In [21]:
df = pd.DataFrame(np.zeros([2,2]))
c = pd.MultiIndex.from_arrays([["A", ""], ["x","y"]])
df.columns = c
df

     A
     x    y
0  0.0  0.0
1  0.0  0.0

In [22]:
df1 = df
df2 = df.copy()
df.iloc[0,:] = 7
df

     A
     x    y
0  7.0  7.0
1  0.0  0.0

In [23]:
df1

     A
     x    y
0  7.0  7.0
1  0.0  0.0

In [24]:
df2

     A
     x    y
0  0.0  0.0
1  0.0  0.0

In [25]:
df3 = pd.concat([df1 ,df2]).reset_index(drop=True)
df3

     A
     x    y
0  7.0  7.0
1  0.0  0.0
2  0.0  0.0
3  0.0  0.0

In [26]:
df3 = pd.concat([df1 ,df2],axis=1)
df3

     A         A
     x    y    x    y
0  7.0  7.0  0.0  0.0
1  0.0  0.0  0.0  0.0

In [27]:
for i in range(3):
    exec(f"df{i} = df")

In [28]:
a = list(range(0,8,2))
print(a)
a = np.reshape(a,(2,2))
print(a)
df = pd.DataFrame(a)
df

[0, 2, 4, 6]
[[0 2]
 [4 6]]

   0  1
0  0  2
1  4  6

In [29]:
df.loc[df[0]==4,:]

   0  1
1  4  6

In [30]:
#or
df.loc[(df[0]==0)|(df[0]==4),:]

   0  1
0  0  2
1  4  6

In [31]:
(df[0]==0)|(df[0]==4)

0    True
1    True
Name: 0, dtype: bool

In [32]:
#and
df.loc[(df[0]==0)&(df[1]==2),:]

   0  1
0  0  2

In [33]:
df.loc[df[0].isin([0,4]),:]

   0  1
0  0  2
1  4  6

In [34]:
df.loc[~(df[0].isin([0])),:] #not in

   0  1
1  4  6

In [35]:
df.loc[~(df[0].isin([0])),:].reset_index(drop=True)

   0  1
0  4  6

In [36]:
arr = np.arange(12).reshape((4, 3))
df = pd.DataFrame(arr,columns=["x","y","z"])
    
df["x"] = df["x"].apply("{:.1%}".format)
df["y"] = df["y"].apply("{:.2f}".format)
df

        x      y   z
0    0.0%   1.00   2
1  300.0%   4.00   5
2  600.0%   7.00   8
3  900.0%  10.00  11

In [37]:
df = pd.DataFrame({"A": ["A1", "A2", "A3"],
                   "B": ["B1", "B2", "B3"],
                   "C": ["C1", "C2", "C3"]},
                  index=["ONE", "TWO", "THREE"])
df

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

In [38]:
df["D"] = 0
df

        A   B   C  D
ONE    A1  B1  C1  0
TWO    A2  B2  C2  0
THREE  A3  B3  C3  0

In [39]:
df.loc["FOUR",:] = 0
df

        A   B   C    D
ONE    A1  B1  C1  0.0
TWO    A2  B2  C2  0.0
THREE  A3  B3  C3  0.0
FOUR    0   0   0  0.0

In [40]:
df.insert(1, "AA", 1)
df

        A  AA   B   C    D
ONE    A1   1  B1  C1  0.0
TWO    A2   1  B2  C2  0.0
THREE  A3   1  B3  C3  0.0
FOUR    0   1   0   0  0.0

In [41]:
df = df.drop(["D","AA"], axis=1)
df

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3
FOUR    0   0   0

In [42]:
df = df.T
df.insert(1, "FIVE", 1)
df = df.T
df

        A   B   C
ONE    A1  B1  C1
FIVE    1   1   1
TWO    A2  B2  C2
THREE  A3  B3  C3
FOUR    0   0   0

In [43]:
df = df.drop(["FOUR","FIVE"], axis=0)
df

        A   B   C
ONE    A1  B1  C1
TWO    A2  B2  C2
THREE  A3  B3  C3

In [44]:
tmp = 1
tmp1 = '{:.1%}'.format(tmp)
print(tmp1)
# 100.0%

tmp2 = '{:.2f}'.format(tmp)
print(tmp2)
# 1.00

100.0%
1.00

In [45]:
i = 4
df = pd.DataFrame(np.reshape(list(range(0,i*i)), (i, i))  )
df[0] = df[0].apply("{:,.0%}".format)
df[1] = df[1].apply("{:,.2f}".format)
df

        0      1   2   3
0      0%   1.00   2   3
1    400%   5.00   6   7
2    800%   9.00  10  11
3  1,200%  13.00  14  15

In [46]:
for i in range(0,len(df)):
    tmp = df.loc[i,0]
    df.loc[i,0] = float(tmp.replace(",","").replace("%",""))/100
df

      0      1   2   3
0   0.0   1.00   2   3
1   4.0   5.00   6   7
2   8.0   9.00  10  11
3  12.0  13.00  14  15